Autodesk.Revit.UI.RibbonItemData.SetContextualHelp(Autodesk.Revit.UI.ContextualHelp)
Sets the contextual help bound with this button data.
contextualHelp: The contextual help.
Since: 2013

Autodesk.Revit.UI.RibbonItemData.GetContextualHelp
Gets the contextual help bound with this control.
Returns: The contextual help assigned to the item, or null if there is no binding assigned.
Since: 2013

Autodesk.Revit.UI.RibbonItemData.ToolTipImage
The image to show as a part of the button extended tooltip
Remarks:  Shown when the cursor hovers over the command.
If neither this property nor LongDescription is supplied, the button will not have
an extended tooltip. Maximum height or width is 355 pixels.
SplitButton and RadioButtonGroup cannot display the tooltip set by this method. SplitButton
shows the current PushButton tooltip and RadioButtonGroup has no tooltip.

Autodesk.Revit.UI.RibbonItemData.LongDescription
Long description of the command tooltip
Remarks:  It will be used as part of the button's extended
tooltip. This tooltip is shown when the mouse hovers over the command for a long amount
of time. You can split the text of this option into multiple paragraphs by placing <p>
tags around each paragraph. Optional. If neither of this property and TooltipImage is
supplied, the button will not have an extended tooltip.
SplitButton and RadioButtonGroup cannot display the tooltip set by this method, the SplitButton will
always show the current PushButton tooltip, and RadioButtonGroup has no tooltip.

Autodesk.Revit.UI.RibbonItemData
Base class used to contain information necessary to construct a RibbonItem in the Ribbon.